requestAll.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:usr="http://home.ru/springsoap/entity">
    <soapenv:Header/>
    <soapenv:Body>
        <usr:getUserListRequest/>
    </soapenv:Body>
</soapenv:Envelope>